БухЭксп/Catalogs/CW_ОбменГИСЭПДФункцииЗначенийРеквизитовЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбменГИСЭПДФункцииЗначенийРеквизитовЭПД</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособПолученияЗначения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстФормулы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторДОПОГЭПД</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУпаковкиЭПД</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращаемоеЗначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ОбменГИСЭПДВидыРезультатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКДанным</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВывода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Множитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ОбменГИСЭПДВидыРезультатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ОбменГИСЭПДВидыРезультатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбменГИСЭПДФункцииЗначенийРеквизитовЭПД/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() И Не ПустаяСтрока(Объект.Наименование) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Идентификатор) Тогда  
			Объект.Идентификатор 	= ИдентификаторПоПредставлению();
		КонецЕсли;
	КонецЕсли;   
	
	CW_ОбменГИСЭПДДополнительный.ЗаполнитьДоступныеТипыОбъектов(ЭтотОбъект);
	
	УстановитьДоступностьСпособаПолученияЗначения();
	ВозвращаемоеЗначениеПриИзмененииНаСервере();                                                  
	
	Если Объект.ВозвращаемоеЗначение = Перечисления.CW_ОбменГИСЭПДВидыРезультатов.ЗначениеРеквизита Тогда
		СпособПолученияЗначенияПриИзмененииНаСервере();     
	КонецЕсли;
	
	УстановитьАдерсСхемыКомпоновки(); 
	УстановитьВидиостьДанных();
	
КонецПроцедуры 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Объект.ВозвращаемоеЗначение = Перечисления.CW_ОбменГИСЭПДВидыРезультатов.ЗначениеРеквизита Тогда
		ТекстФормулы.УстановитьТекст(ТекущийОбъект.ТекстФормулы);
		УстановитьАдерсСхемыКомпоновки(); 
	КонецЕсли;
	Если Объект.ВозвращаемоеЗначение = Перечисления.CW_ОбменГИСЭПДВидыРезультатов.ТабличнаяЧасть Тогда
		ХранимыеНастройкиОтбора = ТекущийОбъект.ХранилищеНастроек.Получить();
		Если ТипЗнч(ХранимыеНастройкиОтбора) = тип("ТаблицаЗначений") Тогда
			НастройкиОтбора.Загрузить(ХранимыеНастройкиОтбора);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)   
	
	ТекущийОбъект.ТекстФормулы = ТекстФормулы.ПолучитьТекст();
	ТекущийОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(НастройкиОтбора.Выгрузить());
	
КонецПроцедуры    

&НаКлиенте
Процедура СпособПолученияЗначенияПриИзменении(Элемент)
	
	Объект.ПутьКДанным 	= Неопределено;
	Объект.Значение		= Неопределено;    
	Объект.ФорматВывода	= Неопределено;    
	ТекстФормулы.Очистить();    
	
	СпособПолученияЗначенияПриИзмененииНаСервере();   
	
	Если Объект.СпособПолученияЗначения = 1 Тогда
		Объект.ТипОбъекта = Неопределено;	
	КонецЕсли;

	УстановитьДоступностьСпособаПолученияЗначения();
	
КонецПроцедуры

&НаСервере
Процедура СпособПолученияЗначенияПриИзмененииНаСервере()
	
	//Реквизит(0), Фиксированное значение(2), Формула(3)
	Элементы.ПутьКДанным.Видимость	= (Объект.СпособПолученияЗначения = 0); 
	Элементы.Значение.Видимость		= (Объект.СпособПолученияЗначения = 1); 
	Элементы.ГруппаТекстФормулы.Видимость	= (Объект.СпособПолученияЗначения = 2);   
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент) 
	
	НаименованиеПриИзмененииНаКлиенте();  
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьИдентифкатор(Команда)
	
	Объект.Идентификатор = ИдентификаторПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзмененииНаКлиенте()
	
	Если НЕ ЗначениеЗаполнено(Объект.Идентификатор) Тогда  
		Объект.Идентификатор = ИдентификаторПоПредставлению();
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ИдентификаторПоПредставлению()
	
	Идентификатор = ПолучитьИдентификаторПоТексту(СокрЛП(Объект.Наименование));
	
	ПолучитьУникальныйИдентификатор(Идентификатор, Идентификатор, Объект.Ссылка);
	
	Возврат СокрЛП(Идентификатор);
	
КонецФункции   

&НаСервере
Функция ПолучитьИдентификаторПоТексту(Знач Представление) Экспорт
	
	СтрокаЦифр 		= "0123456789";
	Идентификатор 	= "";
	БылРазделитель	 = Ложь; 
	
	Для НомСимвола = 1 По СтрДлина(Представление) Цикл
		Символ = Сред(Представление, НомСимвола, 1);
		Если СтрНайти(СтрокаЦифр,Символ) > 0 
			И ПустаяСтрока(Идентификатор) Тогда
			// цифры в начале пропускаем
			Продолжить;
		КонецЕсли;
		Если СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола(Символ)) Тогда
			БылРазделитель = Истина;
		Иначе
			Если БылРазделитель Тогда
				БылРазделитель = Ложь;
				Символ = ВРег(Символ);
			КонецЕсли;
			Идентификатор = Идентификатор + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Идентификатор;
	
КонецФункции

&НаСервере
Процедура ПолучитьУникальныйИдентификатор(Идентификатор, Знач ИсходныйИдентификатор, ТекущаяСсылка)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ОбменГИСЭПДФункцииЗначенийРеквизитовЭПД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ОбменГИСЭПДФункцииЗначенийРеквизитовЭПД КАК CW_ОбменГИСЭПДФункцииЗначенийРеквизитовЭПД
	|ГДЕ
	|	CW_ОбменГИСЭПДФункцииЗначенийРеквизитовЭПД.Ссылка <> &Ссылка
	|	И CW_ОбменГИСЭПДФункцииЗначенийРеквизитовЭПД.Идентификатор = &Идентификатор";   
	
	Запрос.УстановитьПараметр("Ссылка", 			ТекущаяСсылка);
	Запрос.УстановитьПараметр("Идентификатор", 		Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	
	ТекущийКлюч = СтрЗаменить(Идентификатор,ИсходныйИдентификатор,""); 
	ТекущийКлюч = ?(ПустаяСтрока(ТекущийКлюч), 0, Число(ТекущийКлюч));
	ТекущийКлюч = ТекущийКлюч 	+ 1;  
	
	Идентификатор 	= ИсходныйИдентификатор + Формат(ТекущийКлюч, "ЧГ=0");
	
	ПолучитьУникальныйИдентификатор(Идентификатор, ИсходныйИдентификатор, ТекущаяСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКДаннымНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",			Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",	Истина);
	ПараметрыФормы.Вставить("ИдентификаторОбъектовМетаданных", Объект.ТипОбъекта);
	ПараметрыФормы.Вставить("АдресСхемы", 			АдресСхемы);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЭлементаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_ОбменГИСЭПДФункцииЗначенийРеквизитовЭПД.Форма.ФормаВыбораРеквизита", ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЭлементаЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;                                       
	
	Объект.ПутьКДанным = ВыбранноеЗначение;  
	
КонецПроцедуры   

&НаКлиенте
Процедура РеквизитОбъектаПриИзменении(Элемент)   
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент) 
	
	ТипОбъектаПриИзмененииНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ТипОбъектаПриИзмененииНаСервере() 
	
	Если Не ЗначениеЗаполнено(Объект.ТипОбъекта) Тогда
		Объект.СпособПолученияЗначения = 1;
	КонецЕсли;
	
	УстановитьДоступностьСпособаПолученияЗначения();
	
	УстановитьАдерсСхемыКомпоновки();  
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьСпособаПолученияЗначения() 
	
	Элементы.ГруппаСпособПолученияЗначения_0.Доступность = ЗначениеЗаполнено(Объект.ТипОбъекта);
	Элементы.ГруппаСпособПолученияЗначения_2.Доступность = ЗначениеЗаполнено(Объект.ТипОбъекта);
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматВыводаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	
	МассивТипов = ПолучитьДоступныеТипы();
	
	ДоступныеТипы = Новый ОписаниеТипов(МассивТипов);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФорматаВыводаЗавершение",ЭтотОбъект);
	
	Конструктор = Новый КонструкторФорматнойСтроки(Объект.ФорматВывода);
	Конструктор.ДоступныеТипы 	= ДоступныеТипы;
	Конструктор.Показать(ОписаниеОповещения);
	
КонецПроцедуры  

&НаКлиенте
Процедура ВыборФорматаВыводаЗавершение(Текст, ДополнительныеПараметры) Экспорт 
	
	Если Текст = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ФорматВывода = Текст;
	ЭтаФорма.Модифицированность = Истина;   
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьДоступныеТипы()
	
	Если ТипЗнч(ДоступныеТипыФормата) = Тип("ФиксированныйМассив") Тогда
		Массив = Новый Массив(ДоступныеТипыФормата);
	Иначе
		Массив = ПолучитьДоступныеТипыФорматаВывода();
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Функция ПолучитьДоступныеТипыФорматаВывода()
	
	мПримитивныеТипы = Новый Массив;
	мПримитивныеТипы.Добавить(Тип("Дата"));
	мПримитивныеТипы.Добавить(Тип("Число"));
	мПримитивныеТипы.Добавить(Тип("Булево")); 
	
	Возврат мПримитивныеТипы;
	
КонецФункции


&НаКлиенте
Процедура ВозвращаемоеЗначениеПриИзменении(Элемент)
	ВозвращаемоеЗначениеПриИзмененииНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ВозвращаемоеЗначениеПриИзмененииНаСервере()
	
	УстановитьСписокДоступныхМакетов();
	УстановитьВидиостьДанных();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидиостьДанных()
	
	Если Объект.ВозвращаемоеЗначение = Перечисления.CW_ОбменГИСЭПДВидыРезультатов.ЗначениеРеквизита Тогда
		ТекущаяСтраницаНастроек = Элементы.СтраницаСпособПолученияЗначения;                                      
	Иначе
		ТекущаяСтраницаНастроек = Элементы.СтраницаПараметрыПолученияТабличнойЧасти;	                             
	КонецЕсли;
	
	Элементы.СтраницыОсновная.ТекущаяСтраница = ТекущаяСтраницаНастроек;
	
КонецПроцедуры    

&НаСервере
Процедура УстановитьСписокДоступныхМакетов()
	
	Элементы.ИмяМакета.СписокВыбора.Очистить();
	Элементы.ИмяМакета.СписокВыбора.Добавить("Грузоперевозки", "Грузоперевозки");
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов") Тогда
		Элементы.ИмяМакета.СписокВыбора.Добавить("Заказы", "Заказы");
	КонецЕсли;   
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаявок") Тогда
		Элементы.ИмяМакета.СписокВыбора.Добавить("Заявки", "Заявки");
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтбораПолеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.НастройкиОтбора.ТекущаяСтрока);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборПоля", ЭтотОбъект,ДополнительныеПараметры); 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СхемаКомпоновки", АдресСхемы);
	
	ОткрытьФорму("ОбщаяФорма.CW_ЖурналГрузоперевозок_ВыборПоля", СтруктураПараметров, ЭтаФорма,,,,Оповещение);
	
КонецПроцедуры   

&НаКлиенте
Процедура ЗавершитьВыборПоля(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьВыборПоляНаСервере(РезультатВыбора, ДополнительныеПараметры.ИдентификаторСтроки);
	
КонецПроцедуры 

&НаСервере
Процедура ЗавершитьВыборПоляНаСервере(РезультатВыбора, ИдентификаторСтроки)
	
	СтрокаТекущая = НастройкиОтбора.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрокаТекущая.Заголовок 	= РезультатВыбора.Заголовок;
	СтрокаТекущая.ПутьКДанным 	= РезультатВыбора.Поле;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяМакетаПриИзменении(Элемент)

	УстановитьАдерсСхемыКомпоновки();
	
КонецПроцедуры      

&НаСервере
Процедура УстановитьАдерсСхемыКомпоновки()  
	
	Если Объект.ВозвращаемоеЗначение = Перечисления.CW_ОбменГИСЭПДВидыРезультатов.ЗначениеРеквизита 
		И ЗначениеЗаполнено(Объект.ТипОбъекта) Тогда 
		
		СхемаКомпоновкиДанных = CW_ОбменГИСЭПДДополнительный.ПолучитьСхемуКомпоновкиДанных(Объект.ТипОбъекта);
		АдресСхемы 			  = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,Этаформа.УникальныйИдентификатор); 
		
	КонецЕсли;  
	
	Если Объект.ВозвращаемоеЗначение = Перечисления.CW_ОбменГИСЭПДВидыРезультатов.ТабличнаяЧасть 
		И ЗначениеЗаполнено(Объект.ИмяМакета) Тогда 
		
		СоответствиеОбщегоМакетаПоИмени = CW_КлючевыеПоказателиСервер.ПолучитьСоответствиеИмениМакета();
		ИмяМакета 				= СоответствиеОбщегоМакетаПоИмени.Получить(Объект.ИмяМакета);
		СхемаКомпоновкиДанных	= ПолучитьОбщийМакет(ИмяМакета);
		
		АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,Этаформа.УникальныйИдентификатор); 
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура КомандаВыбратьФункцию(Команда)   
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборФункции", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_ОбменГИСЭПДФункцииЗначенийРеквизитовЭПД.ФормаВыбора", ,ЭтотОбъект,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборФункции(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьВыборФункцииНаСервере(РезультатВыбора);	
	
КонецПроцедуры     

&НаСервере
Процедура ЗавершитьВыборФункцииНаСервере(РезультатВыбора)
	
	ДобавитьПеременную(РезультатВыбора.Идентификатор);
	
КонецПроцедуры   

&НаСервере
Процедура ДобавитьПеременную(ИмяПеременной)
	
	ФормулаТекст = ТекстФормулы.ПолучитьТекст();
	ФормулаТекст = ФормулаТекст + " "+ ИмяПеременной; 
	
	ТекстФормулы.УстановитьТекст(СокрЛП(ФормулаТекст));	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПараметрКоманды(Команда)
	
	ДобавитьПеременную("ПараметрКоманды");  
	
КонецПроцедуры
